HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_bf.h
/** \\brief  Offset for Ifx_DMA_BLK_CLRE_Bits.CSRIER */
#define IFX_DMA_BLK_CLRE_CSRIER_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.EDER */
#define IFX_DMA_BLK_EER_EDER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ELER */
#define IFX_DMA_BLK_EER_ELER_OFF (26)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ERER */
#define IFX_DMA_BLK_EER_ERER_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_EER_Bits.ESER */
#define IFX_DMA_BLK_EER_ESER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DER */
#define IFX_DMA_BLK_ERRSR_DER_OFF (17)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.DLLER */
#define IFX_DMA_BLK_ERRSR_DLLER_OFF (26)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_LEN (7)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_MSK (0x7f)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.LEC */
#define IFX_DMA_BLK_ERRSR_LEC_OFF (0)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.RAMER */
#define IFX_DMA_BLK_ERRSR_RAMER_OFF (24)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SER */
#define IFX_DMA_BLK_ERRSR_SER_OFF (16)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SLLER */
#define IFX_DMA_BLK_ERRSR_SLLER_OFF (25)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SPBER */
#define IFX_DMA_BLK_ERRSR_SPBER_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ERRSR_Bits.SRIER */
#define IFX_DMA_BLK_ERRSR_SRIER_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_LEN (4)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.CBLD */
#define IFX_DMA_BLK_ME_ADICR_CBLD_OFF (12)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_LEN (4)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.CBLS */
#define IFX_DMA_BLK_ME_ADICR_CBLS_OFF (8)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.DCBE */
#define IFX_DMA_BLK_ME_ADICR_DCBE_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.DCBE */
#define IFX_DMA_BLK_ME_ADICR_DCBE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.DCBE */
#define IFX_DMA_BLK_ME_ADICR_DCBE_OFF (21)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.DMF */
#define IFX_DMA_BLK_ME_ADICR_DMF_LEN (3)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.DMF */
#define IFX_DMA_BLK_ME_ADICR_DMF_MSK (0x7)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.DMF */
#define IFX_DMA_BLK_ME_ADICR_DMF_OFF (4)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.ETRL */
#define IFX_DMA_BLK_ME_ADICR_ETRL_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.ETRL */
#define IFX_DMA_BLK_ME_ADICR_ETRL_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.ETRL */
#define IFX_DMA_BLK_ME_ADICR_ETRL_OFF (23)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.INCD */
#define IFX_DMA_BLK_ME_ADICR_INCD_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.INCD */
#define IFX_DMA_BLK_ME_ADICR_INCD_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.INCD */
#define IFX_DMA_BLK_ME_ADICR_INCD_OFF (7)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.INCS */
#define IFX_DMA_BLK_ME_ADICR_INCS_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.INCS */
#define IFX_DMA_BLK_ME_ADICR_INCS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.INCS */
#define IFX_DMA_BLK_ME_ADICR_INCS_OFF (3)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.INTCT */
#define IFX_DMA_BLK_ME_ADICR_INTCT_LEN (2)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.INTCT */
#define IFX_DMA_BLK_ME_ADICR_INTCT_MSK (0x3)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.INTCT */
#define IFX_DMA_BLK_ME_ADICR_INTCT_OFF (26)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.IRDV */
#define IFX_DMA_BLK_ME_ADICR_IRDV_LEN (4)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.IRDV */
#define IFX_DMA_BLK_ME_ADICR_IRDV_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.IRDV */
#define IFX_DMA_BLK_ME_ADICR_IRDV_OFF (28)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.SCBE */
#define IFX_DMA_BLK_ME_ADICR_SCBE_LEN (1)

/** \\brief  Mask for Ifx_DMA_BLK_ME_ADICR_Bits.SCBE */
#define IFX_DMA_BLK_ME_ADICR_SCBE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_BLK_ME_ADICR_Bits.SCBE */
#define IFX_DMA_BLK_ME_ADICR_SCBE_OFF (20)

/** \\brief  Length for Ifx_DMA_BLK_ME_ADICR_Bits.SHCT */
#define IFX_DMA_BLK_ME_ADICR_SHCT_LEN (4)

