HAMES2-1st-3/TunnelComfortSystemTesting/include/tc29xa/IfxDma_bf.h
/** \\brief  Length for Ifx_DMA_HRR_Bits.HRP */
#define IFX_DMA_HRR_HRP_LEN (2)

/** \\brief  Mask for Ifx_DMA_HRR_Bits.HRP */
#define IFX_DMA_HRR_HRP_MSK (0x3)

/** \\brief  Offset for Ifx_DMA_HRR_Bits.HRP */
#define IFX_DMA_HRR_HRP_OFF (0)

/** \\brief  Length for Ifx_DMA_ID_Bits.MOD_REV */
#define IFX_DMA_ID_MOD_REV_LEN (8)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MOD_REV */
#define IFX_DMA_ID_MOD_REV_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MOD_REV */
#define IFX_DMA_ID_MOD_REV_OFF (0)

/** \\brief  Length for Ifx_DMA_ID_Bits.MOD_TYPE */
#define IFX_DMA_ID_MOD_TYPE_LEN (8)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MOD_TYPE */
#define IFX_DMA_ID_MOD_TYPE_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MOD_TYPE */
#define IFX_DMA_ID_MOD_TYPE_OFF (8)

/** \\brief  Length for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_LEN (16)

/** \\brief  Mask for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_MSK (0xffff)

/** \\brief  Offset for Ifx_DMA_ID_Bits.MODNUMBER */
#define IFX_DMA_ID_MODNUMBER_OFF (16)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.DATAERR */
#define IFX_DMA_MEMCON_DATAERR_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.DATAERR */
#define IFX_DMA_MEMCON_DATAERR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.DATAERR */
#define IFX_DMA_MEMCON_DATAERR_OFF (6)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.ERRDIS */
#define IFX_DMA_MEMCON_ERRDIS_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.ERRDIS */
#define IFX_DMA_MEMCON_ERRDIS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.ERRDIS */
#define IFX_DMA_MEMCON_ERRDIS_OFF (9)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.INTERR */
#define IFX_DMA_MEMCON_INTERR_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.INTERR */
#define IFX_DMA_MEMCON_INTERR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.INTERR */
#define IFX_DMA_MEMCON_INTERR_OFF (2)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.PMIC */
#define IFX_DMA_MEMCON_PMIC_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.PMIC */
#define IFX_DMA_MEMCON_PMIC_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.PMIC */
#define IFX_DMA_MEMCON_PMIC_OFF (8)

/** \\brief  Length for Ifx_DMA_MEMCON_Bits.RMWERR */
#define IFX_DMA_MEMCON_RMWERR_LEN (1)

/** \\brief  Mask for Ifx_DMA_MEMCON_Bits.RMWERR */
#define IFX_DMA_MEMCON_RMWERR_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MEMCON_Bits.RMWERR */
#define IFX_DMA_MEMCON_RMWERR_OFF (4)

/** \\brief  Length for Ifx_DMA_MODE_Bits.MODE */
#define IFX_DMA_MODE_MODE_LEN (1)

/** \\brief  Mask for Ifx_DMA_MODE_Bits.MODE */
#define IFX_DMA_MODE_MODE_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_MODE_Bits.MODE */
#define IFX_DMA_MODE_MODE_OFF (0)

/** \\brief  Length for Ifx_DMA_OTSS_Bits.BS */
#define IFX_DMA_OTSS_BS_LEN (1)

/** \\brief  Mask for Ifx_DMA_OTSS_Bits.BS */
#define IFX_DMA_OTSS_BS_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_OTSS_Bits.BS */
#define IFX_DMA_OTSS_BS_OFF (7)

/** \\brief  Length for Ifx_DMA_OTSS_Bits.TGS */
#define IFX_DMA_OTSS_TGS_LEN (4)

/** \\brief  Mask for Ifx_DMA_OTSS_Bits.TGS */
#define IFX_DMA_OTSS_TGS_MSK (0xf)

/** \\brief  Offset for Ifx_DMA_OTSS_Bits.TGS */
#define IFX_DMA_OTSS_TGS_OFF (0)

/** \\brief  Length for Ifx_DMA_PRR0_Bits.PAT00 */
#define IFX_DMA_PRR0_PAT00_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR0_Bits.PAT00 */
#define IFX_DMA_PRR0_PAT00_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR0_Bits.PAT00 */
#define IFX_DMA_PRR0_PAT00_OFF (0)

/** \\brief  Length for Ifx_DMA_PRR0_Bits.PAT01 */
#define IFX_DMA_PRR0_PAT01_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR0_Bits.PAT01 */
#define IFX_DMA_PRR0_PAT01_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR0_Bits.PAT01 */
#define IFX_DMA_PRR0_PAT01_OFF (8)

/** \\brief  Length for Ifx_DMA_PRR0_Bits.PAT02 */
#define IFX_DMA_PRR0_PAT02_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR0_Bits.PAT02 */
#define IFX_DMA_PRR0_PAT02_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR0_Bits.PAT02 */
#define IFX_DMA_PRR0_PAT02_OFF (16)

/** \\brief  Length for Ifx_DMA_PRR0_Bits.PAT03 */
#define IFX_DMA_PRR0_PAT03_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR0_Bits.PAT03 */
#define IFX_DMA_PRR0_PAT03_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR0_Bits.PAT03 */
#define IFX_DMA_PRR0_PAT03_OFF (24)

/** \\brief  Length for Ifx_DMA_PRR1_Bits.PAT10 */
#define IFX_DMA_PRR1_PAT10_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR1_Bits.PAT10 */
#define IFX_DMA_PRR1_PAT10_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR1_Bits.PAT10 */
#define IFX_DMA_PRR1_PAT10_OFF (0)

/** \\brief  Length for Ifx_DMA_PRR1_Bits.PAT11 */
#define IFX_DMA_PRR1_PAT11_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR1_Bits.PAT11 */
#define IFX_DMA_PRR1_PAT11_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR1_Bits.PAT11 */
#define IFX_DMA_PRR1_PAT11_OFF (8)

/** \\brief  Length for Ifx_DMA_PRR1_Bits.PAT12 */
#define IFX_DMA_PRR1_PAT12_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR1_Bits.PAT12 */
#define IFX_DMA_PRR1_PAT12_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR1_Bits.PAT12 */
#define IFX_DMA_PRR1_PAT12_OFF (16)

/** \\brief  Length for Ifx_DMA_PRR1_Bits.PAT13 */
#define IFX_DMA_PRR1_PAT13_LEN (8)

/** \\brief  Mask for Ifx_DMA_PRR1_Bits.PAT13 */
#define IFX_DMA_PRR1_PAT13_MSK (0xff)

/** \\brief  Offset for Ifx_DMA_PRR1_Bits.PAT13 */
#define IFX_DMA_PRR1_PAT13_OFF (24)

/** \\brief  Length for Ifx_DMA_SUSACR_Bits.SUSAC */
#define IFX_DMA_SUSACR_SUSAC_LEN (1)

/** \\brief  Mask for Ifx_DMA_SUSACR_Bits.SUSAC */
#define IFX_DMA_SUSACR_SUSAC_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_SUSACR_Bits.SUSAC */
#define IFX_DMA_SUSACR_SUSAC_OFF (0)

/** \\brief  Length for Ifx_DMA_SUSENR_Bits.SUSEN */
#define IFX_DMA_SUSENR_SUSEN_LEN (1)

/** \\brief  Mask for Ifx_DMA_SUSENR_Bits.SUSEN */
#define IFX_DMA_SUSENR_SUSEN_MSK (0x1)

/** \\brief  Offset for Ifx_DMA_SUSENR_Bits.SUSEN */
#define IFX_DMA_SUSENR_SUSEN_OFF (0)

/** \\brief  Length for Ifx_DMA_TIME_Bits.COUNT */
#define IFX_DMA_TIME_COUNT_LEN (32)

/** \\brief  Mask for Ifx_DMA_TIME_Bits.COUNT */
#define IFX_DMA_TIME_COUNT_MSK (0xffffffff)

/** \\brief  Offset for Ifx_DMA_TIME_Bits.COUNT */
#define IFX_DMA_TIME_COUNT_OFF (0)

/** \\brief  Length for Ifx_DMA_TSR_Bits.CH */
#define IFX_DMA_TSR_CH_LEN (1)

